#+title: Example SPARQL queries for evolomero.evolbio.mpg.de
#+property: header-args:sparql :url https://evolomero.evolbio.mpg.de/qlever :async yes :results output table replace :cache yes :exports both :noweb yes
#+property: header-args:ttl :eval no :noweb yes
#+property: header-args:bash :noweb yes :eval query

** All projects with names and IDs
:PROPERTIES:
:ID:       da8e59c5-d071-4e02-b07e-3cf9c6fb989a
:END:
#+begin_src ttl :noweb-ref 001-comment
  Select all projects and list their names and ids.
#+end_src
#+name: 001-skeleton
#+begin_src ttl :tangle 001--all_projects.ttl :exports none
  <<ttl-prefixes>>

  ex:001 a sh:SPARQLExecutable, sh:SPARQLSelectExecutable ;
      rdfs:comment "<<001-comment>>"^^rdf:HTML ;
      sh:prefixes _:sparql_example_prefixes ;
      schema:keywords "project" ;
      schema:target <<idr_sparql_endpoint_url>> ;
      sh:select """
  <<001-sparql>>
  """ .
#+end_src

#+name: 001-sparql
#+begin_src sparql :exports both
  <<sparql-prefixes>>

  select ?project ?name ?id where {
    ?project a omecore:Project ;
             rdfs:label ?name ;
             dc:identifier ?id .
    }
#+end_src

#+RESULTS[96735a1ec71d54e7bf8f0bf85e816adbe2e50bb7]: 001-sparql
| project                                      | name                 |  id |
|----------------------------------------------+----------------------+-----|
| https://evolomero.evolbio.mpg.de/Project/102 | Escamilla2026        | 102 |
| https://evolomero.evolbio.mpg.de/Project/51  | Kyomen..Kaucka--2026 |  51 |

** Gene names and uniprot proteins
:PROPERTIES:
:ID:       edac2060-06c6-4937-b8fb-24b06de3716a
:END:

#+name: sparql.gene-protein
#+begin_src sparql
  <<sparql-prefixes>>

  select * where {
    ?img a omecore:Image;
         omecore:hasAnnotation/omecore:mapEntry ?map .
        ?map omecore:key ?key;
             omecore:value ?gene .
          filter(?key = "Gene")
    #   {
    #   select ?tax_val where {
    #        ?map omecore:key ?key;
    #        omecore:value ?tax_val .
    #     filter(?key = "ncbitaxon")
    #     }
    #   }
    # }
    bind(iri("http://purl.uniprot.org/taxonomy/10090") as ?taxon)
    service <https://sparql.uniprot.org/sparql>
    {
      select ?protein where {
      ?protein a up:Protein;
              up:organism <http://purl.uniprot.org/taxonomy/10090> ;
              up:mnemonic ?mnemonic .
      filter(concat(ucase(str(?gene)), "_MOUSE") = ?mnemonic)
        }
    }
    }
  limit 100
#+end_src

#+RESULTS[6f387101edcb396329361b183d7209f661f1860e]: sparql.gene-protein
| img | map | key | gene | taxon | protein |
|-----+-----+-----+------+-------+---------|

#+begin_src sparql :url https://sparql.uniprot.org/sparql
  PREFIX up: <http://purl.uniprot.org/core/>
  select * where
  {
        ?protein a up:Protein;
                up:organism <http://purl.uniprot.org/taxonomy/10090> ;
                up:mnemonic ?mnemonic .
        # filter(contains(lcase(?mnemonic), "dlx2"))
      filter(concat(ucase("Dlx2"), "_MOUSE") = ?mnemonic)
        }
      limit 10
#+end_src

#+RESULTS[76d2418fdd81184adbb8e0e8df9f3437ac0e6fbe]:
| protein                                | mnemonic   |
|----------------------------------------+------------|
| http://purl.uniprot.org/uniprot/P40764 | DLX2_MOUSE |
